<?xml version="1.0" ?>
<net name="dacovadetection_20221214_145226_331380" version="11">
	<layers>
		<layer id="0" name="image_input" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,960,960,3"/>
			<rt_info>
				<attribute name="fused_names" value="image_input" version="0"/>
				<attribute name="old_api_map_order" value="0, 2, 3, 1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="image_input:0" precision="FP32">
					<dim>1</dim>
					<dim>960</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="image_input/Transpose([0 3 1 2])/value1448421331" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="image_input/Transpose([0 3 1 2])/value1448421331" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="image_input/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="image_input/Transpose([0 3 1 2])" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>960</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>960</dim>
					<dim>960</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="32" shape="16, 3, 3, 3" size="1728"/>
			<rt_info>
				<attribute name="fused_names" value="Conv/BatchNorm/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="Conv/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="Conv/Conv2D, Conv_pad/Pad" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>960</dim>
					<dim>960</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Conv/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="1760" shape="1, 16, 1, 1" size="64"/>
			<rt_info>
				<attribute name="fused_names" value="Conv/BatchNorm/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="Conv/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Conv/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="Conv/BatchNorm/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="Conv/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="activation/multiply/mul" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="activation/activation/mul, activation/multiply/mul" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation/multiply/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="expanded_conv/depthwise/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="1824" shape="16, 1, 1, 3, 3" size="576"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/depthwise/BatchNorm/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv/depthwise/Conv/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="expanded_conv/depthwise/Conv/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/depthwise/Conv/depthwise, expanded_conv/depthwise/pad/Pad" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/depthwise/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="expanded_conv/depthwise/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="2400" shape="1, 16, 1, 1" size="64"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/depthwise/BatchNorm/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv/depthwise/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="expanded_conv/depthwise/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/depthwise/BatchNorm/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/depthwise/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="activation_1/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="activation_1/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="expanded_conv/squeeze_excite/AvgPool/MeanGather1608721253" type="Const" version="opset1">
			<data element_type="i64" offset="2464" shape="2" size="16"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/squeeze_excite/AvgPool/MeanGather1608721253" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="expanded_conv/squeeze_excite/AvgPool/Mean" type="ReduceMean" version="opset1">
			<data keep_dims="false"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/squeeze_excite/AvgPool/Mean" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/squeeze_excite/AvgPool/Mean:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="reshape/Shape" type="ShapeOf" version="opset3">
			<data output_type="i32"/>
			<rt_info>
				<attribute name="fused_names" value="reshape/Shape" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" names="reshape/Shape:0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="reshape/strided_slice/stack" type="Const" version="opset1">
			<data element_type="i64" offset="2480" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="reshape/strided_slice/stack" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="reshape/strided_slice/stack:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="reshape/strided_slice/stack_1" type="Const" version="opset1">
			<data element_type="i64" offset="2488" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="reshape/strided_slice/stack_1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="reshape/strided_slice/stack_1:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="reshape/strided_slice/stack_2" type="Const" version="opset1">
			<data element_type="i64" offset="2488" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="reshape/strided_slice/stack_2" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="reshape/strided_slice/stack_2:0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="reshape/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="1"/>
			<rt_info>
				<attribute name="fused_names" value="reshape/strided_slice, reshape/strided_slice/stack, reshape/strided_slice/stack_1, reshape/strided_slice/stack_2" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" names="reshape/strided_slice:0" precision="I32"/>
			</output>
		</layer>
		<layer id="20" name="reshape/Reshape/shape/Unsqueeze_input_port_1/value" type="Const" version="opset1">
			<data element_type="i64" offset="2480" shape="1" size="8"/>
			<rt_info>
				<attribute name="fused_names" value="reshape/Reshape/shape/Unsqueeze_input_port_1/value" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="reshape/Reshape/shape/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="reshape/Reshape/shape/Unsqueeze, reshape/Reshape/shape/Unsqueeze_input_port_1/value" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I32"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="reshape/Reshape/shape/Unsqueeze1428" type="Const" version="opset1">
			<data element_type="i32" offset="2496" shape="1" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="reshape/Reshape/shape/Unsqueeze1428" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="reshape/Reshape/shape/Unsqueeze1430" type="Const" version="opset1">
			<data element_type="i32" offset="2496" shape="1" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="reshape/Reshape/shape/Unsqueeze1430" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="reshape/Reshape/shape/Unsqueeze1432" type="Const" version="opset1">
			<data element_type="i32" offset="2500" shape="1" size="4"/>
			<rt_info>
				<attribute name="fused_names" value="reshape/Reshape/shape/Unsqueeze1432" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="reshape/Reshape/shape" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" value="reshape/Reshape/shape, reshape/Reshape/shape/Unsqueeze1428, reshape/Reshape/shape/Unsqueeze1430, reshape/Reshape/shape/Unsqueeze1432" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="reshape/Reshape/Cast_1" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<rt_info>
				<attribute name="fused_names" value="reshape/Reshape/Cast_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" names="reshape/Reshape/shape:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<rt_info>
				<attribute name="fused_names" value="reshape/Reshape" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_3279" type="Const" version="opset1">
			<data element_type="i64" offset="2504" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="reshape/Reshape/Transpose" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" value="reshape/Reshape/Transpose" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="reshape/Reshape:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="expanded_conv/squeeze_excite/Conv/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="2536" shape="8, 16, 1, 1" size="512"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/squeeze_excite/Conv/Conv2D/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv/squeeze_excite/Conv/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="expanded_conv/squeeze_excite/Conv/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/squeeze_excite/Conv/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/squeeze_excite/Conv/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="expanded_conv/squeeze_excite/Conv/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="3048" shape="1, 8, 1, 1" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/squeeze_excite/Conv/BiasAdd/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv/squeeze_excite/Conv/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="expanded_conv/squeeze_excite/Conv/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/squeeze_excite/Conv/BiasAdd/Add" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/squeeze_excite/Conv/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="expanded_conv/squeeze_excite/Relu/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/squeeze_excite/Relu/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="expanded_conv/squeeze_excite/Relu/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="expanded_conv/squeeze_excite/Conv_1/Conv2D/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="3080" shape="16, 8, 1, 1" size="512"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/squeeze_excite/Conv_1/Conv2D/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv/squeeze_excite/Conv_1/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="expanded_conv/squeeze_excite/Conv_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/squeeze_excite/Conv_1/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/squeeze_excite/Conv_1/Conv2D:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="expanded_conv/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp" type="Const" version="opset1">
			<data element_type="f32" offset="3592" shape="1, 16, 1, 1" size="64"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv/squeeze_excite/Conv_1/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="expanded_conv/squeeze_excite/Conv_1/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/squeeze_excite/Conv_1/BiasAdd/Add" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/squeeze_excite/Conv_1/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="activation_2/mul" type="HSigmoid" version="opset5">
			<rt_info>
				<attribute name="fused_names" value="activation_2/mul" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_2/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="expanded_conv/squeeze_excite/Mul/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/squeeze_excite/Mul/mul" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/squeeze_excite/Mul/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="expanded_conv/project/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="3656" shape="16, 16, 1, 1" size="1024"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/project/BatchNorm/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv/project/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="expanded_conv/project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/project/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/project/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="expanded_conv/project/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="4680" shape="1, 16, 1, 1" size="64"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/project/BatchNorm/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv/project/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="expanded_conv/project/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv/project/BatchNorm/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv/project/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="expanded_conv_1/expand/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="4744" shape="72, 16, 1, 1" size="4608"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_1/expand/BatchNorm/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_1/expand/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="expanded_conv_1/expand/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_1/expand/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_1/expand/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="expanded_conv_1/expand/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="9352" shape="1, 72, 1, 1" size="288"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_1/expand/BatchNorm/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_1/expand/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="expanded_conv_1/expand/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_1/expand/BatchNorm/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_1/expand/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="activation_3/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="activation_3/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_3/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="expanded_conv_1/depthwise/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="9640" shape="72, 1, 1, 3, 3" size="2592"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_1/depthwise/BatchNorm/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_1/depthwise/Conv/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="expanded_conv_1/depthwise/Conv/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_1/depthwise/Conv/depthwise, expanded_conv_1/depthwise/pad/Pad" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_1/depthwise/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="expanded_conv_1/depthwise/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="12232" shape="1, 72, 1, 1" size="288"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_1/depthwise/BatchNorm/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_1/depthwise/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="expanded_conv_1/depthwise/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_1/depthwise/BatchNorm/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_1/depthwise/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="activation_4/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="activation_4/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_4/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="expanded_conv_1/project/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="12520" shape="24, 72, 1, 1" size="6912"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_1/project/BatchNorm/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_1/project/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="expanded_conv_1/project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_1/project/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>72</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_1/project/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="expanded_conv_1/project/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="19432" shape="1, 24, 1, 1" size="96"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_1/project/BatchNorm/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_1/project/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="expanded_conv_1/project/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_1/project/BatchNorm/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_1/project/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="expanded_conv_2/expand/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="19528" shape="88, 24, 1, 1" size="8448"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_2/expand/BatchNorm/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_2/expand/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="expanded_conv_2/expand/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_2/expand/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_2/expand/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="expanded_conv_2/expand/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="27976" shape="1, 88, 1, 1" size="352"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_2/expand/BatchNorm/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_2/expand/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="expanded_conv_2/expand/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_2/expand/BatchNorm/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_2/expand/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="activation_5/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="activation_5/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_5/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="expanded_conv_2/depthwise/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="28328" shape="88, 1, 1, 3, 3" size="3168"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_2/depthwise/BatchNorm/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_2/depthwise/Conv/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="expanded_conv_2/depthwise/Conv/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_2/depthwise/Conv/depthwise" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_2/depthwise/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="expanded_conv_2/depthwise/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="31496" shape="1, 88, 1, 1" size="352"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_2/depthwise/BatchNorm/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_2/depthwise/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="expanded_conv_2/depthwise/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_2/depthwise/BatchNorm/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_2/depthwise/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="activation_6/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="activation_6/Relu" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_6/Relu:0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="expanded_conv_2/project/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="31848" shape="24, 88, 1, 1" size="8448"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_2/project/BatchNorm/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_2/project/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>24</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="expanded_conv_2/project/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_2/project/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>88</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>88</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_2/project/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="expanded_conv_2/project/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="40296" shape="1, 24, 1, 1" size="96"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_2/project/BatchNorm/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_2/project/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="expanded_conv_2/project/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_2/project/BatchNorm/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_2/project/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="expanded_conv_2/Add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_2/Add/add" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_2/Add/add:0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="expanded_conv_3/expand/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="40392" shape="96, 24, 1, 1" size="9216"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_3/expand/BatchNorm/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_3/expand/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="expanded_conv_3/expand/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_3/expand/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_3/expand/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="expanded_conv_3/expand/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="49608" shape="1, 96, 1, 1" size="384"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_3/expand/BatchNorm/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_3/expand/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="expanded_conv_3/expand/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_3/expand/BatchNorm/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_3/expand/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="activation_7/multiply_1/mul" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="activation_7/activation_1/mul, activation_7/multiply_1/mul" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="activation_7/multiply_1/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="expanded_conv_3/depthwise/BatchNorm/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="49992" shape="96, 1, 1, 5, 5" size="9600"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_3/depthwise/BatchNorm/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_3/depthwise/Conv/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="expanded_conv_3/depthwise/Conv/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="2, 2" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_3/depthwise/Conv/depthwise, expanded_conv_3/depthwise/pad/Pad" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_3/depthwise/BatchNorm/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="expanded_conv_3/depthwise/BatchNorm/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="59592" shape="1, 96, 1, 1" size="384"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_3/depthwise/BatchNorm/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="expanded_conv_3/depthwise/BatchNorm/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="expanded_conv_3/depthwise/BatchNorm/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="expanded_conv_3/depthwise/BatchNorm/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="expanded_conv_3/depthwise/BatchNorm/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="activation_8/multiply_2/mul" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" value="activation_8/activation_2/mul, activation_8/multiply_2/mul" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
