<?xml version="1.0" ?>
<net name="dacovadetection_20221129_13345_265666_infer" version="11">
	<layers>
		<layer id="0" name="image_input" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,960,960,3"/>
			<rt_info>
				<attribute name="fused_names" value="image_input" version="0"/>
				<attribute name="old_api_map_order" value="0, 2, 3, 1" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="image_input:0" precision="FP32">
					<dim>1</dim>
					<dim>960</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="image_input/Transpose([0 3 1 2])/value1360419655" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<rt_info>
				<attribute name="fused_names" value="image_input/Transpose([0 3 1 2])/value1360419655" version="0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="image_input/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" value="image_input/Transpose([0 3 1 2])" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>960</dim>
					<dim>960</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>960</dim>
					<dim>960</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="conv1_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="32" shape="32, 3, 3, 3" size="3456"/>
			<rt_info>
				<attribute name="fused_names" value="conv1_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv1/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="conv1/Conv2D, conv1_pad/Pad" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>960</dim>
					<dim>960</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv1_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv1_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="3488" shape="1, 32, 1, 1" size="128"/>
			<rt_info>
				<attribute name="fused_names" value="conv1_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv1_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv1_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv1_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv1_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="conv1_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv1_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv1_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv_dw_1_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="3616" shape="32, 1, 1, 3, 3" size="1152"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_1_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_1/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="conv_dw_1/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_1/depthwise" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_1_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="conv_dw_1_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="4768" shape="1, 32, 1, 1" size="128"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_1_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_1_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv_dw_1_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_1_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_1_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="conv_dw_1_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_1_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv_dw_1_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="conv_pw_1_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="4896" shape="64, 32, 1, 1" size="8192"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_1_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_pw_1/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="conv_pw_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_1/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_pw_1_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv_pw_1_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="13088" shape="1, 64, 1, 1" size="256"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_1_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_pw_1_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="conv_pw_1_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_1_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_pw_1_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="conv_pw_1_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_1_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv_pw_1_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="conv_dw_2_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="13344" shape="64, 1, 1, 3, 3" size="2304"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_2_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_2/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="conv_dw_2/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_2/depthwise, conv_pad_2/Pad" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>480</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_2_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="conv_dw_2_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="15648" shape="1, 64, 1, 1" size="256"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_2_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_2_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="conv_dw_2_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_2_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_2_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="conv_dw_2_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_2_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv_dw_2_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="conv_pw_2_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="15904" shape="128, 64, 1, 1" size="32768"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_2_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_pw_2/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="conv_pw_2/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_2/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_pw_2_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv_pw_2_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="48672" shape="1, 128, 1, 1" size="512"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_2_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_pw_2_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="conv_pw_2_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_2_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_pw_2_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv_pw_2_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_2_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv_pw_2_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="conv_dw_3_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="49184" shape="128, 1, 1, 3, 3" size="4608"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_3_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_3/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv_dw_3/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_3/depthwise" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_3_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="conv_dw_3_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="53792" shape="1, 128, 1, 1" size="512"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_3_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_3_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="conv_dw_3_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_3_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_3_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="conv_dw_3_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_3_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv_dw_3_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="conv_pw_3_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="54304" shape="128, 128, 1, 1" size="65536"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_3_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_pw_3/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="conv_pw_3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_3/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_pw_3_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv_pw_3_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="119840" shape="1, 128, 1, 1" size="512"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_3_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_pw_3_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv_pw_3_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_3_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_pw_3_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="conv_pw_3_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_3_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv_pw_3_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="conv_dw_4_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="120352" shape="128, 1, 1, 3, 3" size="4608"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_4_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_4/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="conv_dw_4/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_4/depthwise, conv_pad_4/Pad" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>240</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_4_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv_dw_4_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="124960" shape="1, 128, 1, 1" size="512"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_4_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_4_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="conv_dw_4_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_4_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_4_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="conv_dw_4_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_4_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv_dw_4_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="conv_pw_4_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="125472" shape="256, 128, 1, 1" size="131072"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_4_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_pw_4/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="conv_pw_4/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_4/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_pw_4_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="conv_pw_4_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="256544" shape="1, 256, 1, 1" size="1024"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_4_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_pw_4_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="conv_pw_4_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_4_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_pw_4_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="conv_pw_4_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_4_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv_pw_4_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="conv_dw_5_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="257568" shape="256, 1, 1, 3, 3" size="9216"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_5_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_5/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="conv_dw_5/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_5/depthwise" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_5_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="conv_dw_5_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="266784" shape="1, 256, 1, 1" size="1024"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_5_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_5_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="conv_dw_5_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_5_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_5_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="conv_dw_5_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_5_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv_dw_5_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="conv_pw_5_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="267808" shape="256, 256, 1, 1" size="262144"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_5_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_pw_5/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="conv_pw_5/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_5/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_pw_5_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="conv_pw_5_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="529952" shape="1, 256, 1, 1" size="1024"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_5_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_pw_5_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="conv_pw_5_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_5_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_pw_5_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="conv_pw_5_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_5_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv_pw_5_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="conv_dw_6_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="530976" shape="256, 1, 1, 3, 3" size="9216"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_6_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_6/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="conv_dw_6/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="1, 1" strides="2, 2"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_6/depthwise, conv_pad_6/Pad" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>120</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_6_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="conv_dw_6_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="540192" shape="1, 256, 1, 1" size="1024"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_6_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_6_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="conv_dw_6_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_6_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_6_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="conv_dw_6_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_6_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv_dw_6_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="conv_pw_6_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="541216" shape="512, 256, 1, 1" size="524288"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_6_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_pw_6/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="conv_pw_6/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_6/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_pw_6_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="conv_pw_6_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="1065504" shape="1, 512, 1, 1" size="2048"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_6_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_pw_6_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="conv_pw_6_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_6_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_pw_6_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="conv_pw_6_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_6_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv_pw_6_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="conv_dw_7_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="1067552" shape="512, 1, 1, 3, 3" size="18432"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_7_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_7/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="conv_dw_7/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_7/depthwise" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_7_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="conv_dw_7_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="1085984" shape="1, 512, 1, 1" size="2048"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_7_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_7_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="conv_dw_7_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_7_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_7_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="conv_dw_7_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_7_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv_dw_7_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="conv_pw_7_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="1088032" shape="512, 512, 1, 1" size="1048576"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_7_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_pw_7/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="conv_pw_7/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_7/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_pw_7_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="conv_pw_7_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="2136608" shape="1, 512, 1, 1" size="2048"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_7_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_pw_7_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="conv_pw_7_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_7_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_pw_7_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="conv_pw_7_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_7_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv_pw_7_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="conv_dw_8_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="2138656" shape="512, 1, 1, 3, 3" size="18432"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_8_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_8/depthwise/ReadVariableOp:0" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="conv_dw_8/depthwise" type="GroupConvolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_8/depthwise" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_8_bn/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="conv_dw_8_bn/batchnorm/sub" type="Const" version="opset1">
			<data element_type="f32" offset="2157088" shape="1, 512, 1, 1" size="2048"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_8_bn/batchnorm/sub" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_dw_8_bn/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="conv_dw_8_bn/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_8_bn/batchnorm/add_1" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="conv_dw_8_bn/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="conv_dw_8_relu/Relu6" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<rt_info>
				<attribute name="fused_names" value="conv_dw_8_relu/Relu6" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" names="conv_dw_8_relu/Relu6:0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="conv_pw_8_bn/batchnorm/mul_1_copy" type="Const" version="opset1">
			<data element_type="f32" offset="2159136" shape="512, 512, 1, 1" size="1048576"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_8_bn/batchnorm/mul_1_copy" version="0"/>
			</rt_info>
			<output>
				<port id="0" names="conv_pw_8/Conv2D/ReadVariableOp:0" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="conv_pw_8/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<rt_info>
				<attribute name="fused_names" value="conv_pw_8/Conv2D" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>60</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
